KASTORPROJECT/src/DataProcessors/СинхронизацияСAD/СинхронизацияСAD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СинхронизацияСAD</name>
</mdclass:DataProcessor>

KASTORPROJECT/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/DataProcessors/СинхронизацияСAD/ManagerModule.bsl
Процедура ЗагрузитьПользователейИзБазы1С(текБаза, АдресХранилищаТабПользователи) Экспорт
	СообщениеОбОшике = "";
	
	Если ЗначениеЗаполнено(АдресХранилищаТабПользователи) Тогда
		табПользователи = ПолучитьИзВременногоХранилища(АдресХранилищаТабПользователи);
	КонецЕсли;
	
	
	БазаCom = адм_Интеграция.V83ПодключитьБазу(текБаза, СообщениеОбОшике);
	
	ЗапросБазаCOM = БазаCom.NewObject("Запрос");
	
	ЗапросБазаCOM.Текст = "ВЫБРАТЬ
		|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
			
	РезультатЗапроса = ЗапросБазаCOM.Выполнить();
	ВыборкаДетальныеЗАписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗАписи.Следующий() Цикл 
		ИдентификаторПользователяИБ	 = БазаCOM.XMLСтрока(ВыборкаДетальныеЗАписи.ИдентификаторПользователяИБ);
		УИД	 = БазаCOM.XMLСтрока(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());

		Наименование				 = ВыборкаДетальныеЗАписи.Наименование;
		
		текПользователь = ПолучитьСсылкуПоИД(УИД, "ПользователиИБ");
		
		новСтрПользователь = табПользователи.Добавить(); 
		ЗаполнитьЗначенияСвойств(новСтрПользователь, ВыборкаДетальныеЗАписи);
		//новСтрПользователь.Наименование = Наименование;
		//новСтрПользователь.ИдентификаторПользователяИБ = ИдентификаторПользователяИБ;
		новСтрПользователь.ПользовательИБСсылка	 = текПользователь;
		новСтрПользователь.УИД					 = УИД;
		
		//Если текПользователь = Неопределено ИЛИ текПользователь = Справочники.ПользователиИБ.ПустаяСсылка() Тогда
		//	
		//КонецЕсли;
		
		
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСсылкуПоИД(УИД, ТипСправочника)
	искСсылка = Справочники[ТипСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	
	Если искСсылка.Ссылка = Справочники[ТипСправочника].ПустаяСсылка() ИЛИ Найти(Строка(искСсылка), "<Объект не найден>") > 0 Тогда
		Возврат "";
	Иначе
		Возврат искСсылка;	
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьОрганизациийИзБазы1С(текБаза, АдресХранилищаТабОрганизациии) Экспорт
	СообщениеОбОшике = "";
	
	Если ЗначениеЗаполнено(АдресХранилищаТабОрганизациии) Тогда
		табОрганизациии = ПолучитьИзВременногоХранилища(АдресХранилищаТабОрганизациии);
	КонецЕсли;
	
	БазаCom = адм_Интеграция.V83ПодключитьБазу(текБаза, СообщениеОбОшике);
	
	ЗапросБазаCOM = БазаCom.NewObject("Запрос");
	
	ЗапросБазаCOM.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.Наименование КАК Наименование,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	"""" КАК УИД,
	|	"""" КАК ОрганизацияСсылка,
	|	ЛОЖЬ КАК Добавить
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	РезультатЗапроса = ЗапросБазаCOM.Выполнить();
	ВыборкаДетальныеЗАписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗАписи.Следующий() Цикл 
		УИД	 = БазаCOM.XMLСтрока(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
		текОрганизация = ПолучитьСсылкуПоИД(УИД, "Организации");
		
		новСтрОрганизация = табОрганизациии.Добавить();
        ЗаполнитьЗначенияСвойств(новСтрОрганизация, ВыборкаДетальныеЗАписи);
		
		новСтрОрганизация.УИД = УИД;
		новСтрОрганизация.ОрганизацияСсылка = текОрганизация;
		
		Если НЕ ЗначениеЗаполнено(текОрганизация) Тогда
			новСтрОрганизация.Добавить = Истина;	
		КонецЕсли;
		//Если текПользователь = Неопределено ИЛИ текПользователь = Справочники.ПользователиИБ.ПустаяСсылка() Тогда
		//	
		//КонецЕсли;
		
		
	КонецЦикла;
КонецПроцедуры


Процедура ЗагрузитьФизическиеЛицаИзБазы1С(текБаза, АдресХранилищаТабФизическиеЛица) Экспорт
	СообщениеОбОшике = "";
	
	Если ЗначениеЗаполнено(АдресХранилищаТабФизическиеЛица) Тогда
		ТабФизическиеЛица = ПолучитьИзВременногоХранилища(АдресХранилищаТабФизическиеЛица);
	КонецЕсли;
	
	
	БазаCom = адм_Интеграция.V83ПодключитьБазу(текБаза, СообщениеОбОшике);
	
	ЗапросБазаCOM = БазаCom.NewObject("Запрос");
	
	ЗапросБазаCOM.Текст = "ВЫБРАТЬ
	|	"""" КАК ФизическоеЛицоСсылка,
	|	ЛОЖЬ КАК Добавить,
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.Наименование КАК Наименование,
	|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
	|	ФизическиеЛица.Пол КАК Пол,
	|	ФизическиеЛица.ИНН КАК ИНН,
	|	ФизическиеЛица.Фамилия КАК Фамилия,
	|	ФизическиеЛица.Имя КАК Имя,
	|	ФизическиеЛица.Отчество КАК Отчество,
	|	"""" КАК УИД
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица";
	
	
	РезультатЗапроса = ЗапросБазаCOM.Выполнить();
	ВыборкаДетальныеЗАписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗАписи.Следующий() Цикл 
		ИдентификаторФЛ	= БазаCOM.XMLСтрока(ВыборкаДетальныеЗАписи.Ссылка.УникальныйИдентификатор());
		Наименование				 = ВыборкаДетальныеЗАписи.Наименование;
		
		текФЛ = ПолучитьСсылкуПоИД(ИдентификаторФЛ, "ФизическиеЛица");
		
		новСтрФЛ = ТабФизическиеЛица.Добавить();
		ЗаполнитьЗначенияСвойств(новСтрФЛ, ВыборкаДетальныеЗАписи);
		новСтрФЛ.ФизическоеЛицоСсылка = текФЛ;
		новСтрФЛ.УИД = ИдентификаторФЛ;
		
		Если НЕ ЗначениеЗаполнено(текФЛ) Тогда
			новСтрФЛ.Добавить = Истина;	
		КонецЕсли;
		
		
	КонецЦикла;
КонецПроцедуры
